docs/NOTES-python-gnupg-3.1-audit.org
#+TITLE:     python-gnupg audit
#+AUTHOR:    isis
#+EMAIL:     isis@leap.se
#+DATE:      2013-02-01 Fri
#+DESCRIPTION:
#+KEYWORDS:
#+LANGUAGE:  en
#+OPTIONS:   H:3 num:t toc:t \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+INFOJS_OPT: view:nil toc:2 ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:   
#+LINK_HOME: 
#+XSLT:

[2013-02-01 Fri]

* gnugp.__main__()
** comments
L58 NullHandler?? see self._write_passphrase
L61 there nifty check for p3k
** def _copy_data(instream, outstream)                              :cleanup:
   copies data from one stream to another, 1024 bytes at a time.
*** L79:                                                          :bad_logic:
    instream is apparently a file descriptor, but is not checked nor
    encased in a try/except block.

*** L78:                                               :hanging_fd:bad_logic:
    while True: loop, should be 
    : with open(instream) as instrm:
*** L88:                                             :bad_exception_handling:
    : except: 
    should catch an IOError, or whatever specific error is raised for broken
    pipes.
** def _threaded_copy_data(instream, outstream):
*** L99:
    this just wraps self._copy_data in a thread
** def _write_passphrase(stream, passphrase, encoding):        :vuln:cleanup:
*** L110:                                         :writes_passphrase_to_disk:
    logger writes passphrase into debug log. this should be patched.
* class Verify(object)
  basic parsing class, no errors found
* class ImportResult(object)
  basic parsing class, no errors found
* class ListKeys(list):
  basic parsing class, no errors found
* class Crypt(Verify):
  basic parsing class, no errors found
** def __init__(self, gpg)                                          :cleanup:
*** L338                                                       :mro_conflict:

    #+BEGIN_SRC python
    Verify.__init__(self,gpg)
    #+END_SRC

    should be changed to:

    #+BEGIN_SRC python
    super(Verify, self).__init__(gpg)
    #+END_SRC
* class GenKey(object)
  basic parsing class, no errors found
* class DeleteResult(object)
  basic parsing class, no errors found
* class Sign(object)
  basic parsing class, no errors found
* class GPG(object)                                             :exploitable:
*** L474:                                                           :cleanup:
    : cls.__doc__ 
    should go directly underneath class signature
** def __init__(self, gpgbinary='gpg', gnupghome=None, verbose=False, use_agent=False, keyring=None) :bug:
