NOTES-python-gnupg-3.1-audit.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>python-gnupg audit</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="python-gnupg audit"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-02-01 Fri"/>
<meta name="author" content="isis"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">python-gnupg audit</h1>

<p> <span class="timestamp-wrapper"> <span class="timestamp">2013-02-01 Fri</span></span><br/>
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 gnugp._<sub>main</sub>_<sub>()</sub></a>
<ul>
<li><a href="#sec-1-1">1.1 comments</a></li>
<li><a href="#sec-1-2">1.2 def <sub>copy</sub><sub>data</sub>(instream, outstream)</a>
<ul>
<li><a href="#sec-1-2-1">1.2.1 L79:</a></li>
<li><a href="#sec-1-2-2">1.2.2 L78:</a></li>
<li><a href="#sec-1-2-3">1.2.3 L88:</a></li>
</ul>
</li>
<li><a href="#sec-1-3">1.3 def <sub>threaded</sub><sub>copy</sub><sub>data</sub>(instream, outstream):</a>
<ul>
<li><a href="#sec-1-3-1">1.3.1 L99:</a></li>
</ul>
</li>
<li><a href="#sec-1-4">1.4 def <sub>write</sub><sub>passphrase</sub>(stream, passphrase, encoding):</a>
<ul>
<li><a href="#sec-1-4-1">1.4.1 L110:</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-2">2 class Verify(object)</a></li>
<li><a href="#sec-3">3 class ImportResult(object)</a></li>
<li><a href="#sec-4">4 class ListKeys(list):</a></li>
<li><a href="#sec-5">5 class Crypt(Verify):</a>
<ul>
<li><a href="#sec-5-1">5.1 def _<sub>init</sub>_<sub>(self, gpg)</sub></a>
<ul>
<li><a href="#sec-5-1-1">5.1.1 L338</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-6">6 class GenKey(object)</a></li>
<li><a href="#sec-7">7 class DeleteResult(object)</a></li>
<li><a href="#sec-8">8 class Sign(object)</a></li>
<li><a href="#sec-9">9 class GPG(object)</a>
<ul>
<li>
<ul>
<li><a href="#sec-9-1">9.1 L474:</a></li>
</ul>
</li>
<li><a href="#sec-9-1">9.1 def _<sub>init</sub>_<sub>(self, gpgbinary='gpg', gnupghome=None, verbose=False, use<sub>agent</sub>=False, keyring=None)</sub></a>
<ul>
<li><a href="#sec-9-1-1">9.1.1 L494-495:</a></li>
</ul>
</li>
<li><a href="#sec-9-2">9.2 def <sub>open</sub><sub>subprocess</sub>(self, args, passphrase=False)</a>
<ul>
<li><a href="#sec-9-2-1">9.2.1 L515:</a></li>
</ul>
</li>
<li><a href="#sec-9-3">9.3 def <sub>collect</sub><sub>output</sub>(self, process, result, writer=None, stdin=None)</a></li>
<li><a href="#sec-9-4">9.4 def <sub>handle</sub><sub>io</sub>(self, args, file, result, passphrase=None, binary=False)</a>
<ul>
<li><a href="#sec-9-4-1">9.4.1 L601:</a></li>
</ul>
</li>
<li><a href="#sec-9-5">9.5 def sign(self, message, **kwargs)</a>
<ul>
<li><a href="#sec-9-5-1">9.5.1 L617-619:</a></li>
</ul>
</li>
<li><a href="#sec-9-6">9.6 def sign<sub>file</sub>(self, file, keyid=None, passphrase=None, clearsign=True, detach=False, binary=False)</a>
<ul>
<li><a href="#sec-9-6-1">9.6.1 L632-635:</a></li>
<li><a href="#sec-9-6-2">9.6.2 L626-641:</a></li>
</ul>
</li>
<li><a href="#sec-9-7">9.7 def verify(self, data):</a>
<ul>
<li><a href="#sec-9-7-1">9.7.1 L668-670:</a></li>
</ul>
</li>
<li><a href="#sec-9-8">9.8 def verify<sub>file</sub>(self, file, data<sub>filename</sub>=None)</a>
<ul>
<li><a href="#sec-9-8-1">9.8.1 L683:</a></li>
<li><a href="#sec-9-8-2">9.8.2 L684:</a></li>
<li><a href="#sec-9-8-3">9.8.3 L690:</a></li>
</ul>
</li>
<li><a href="#sec-9-9">9.9 def import<sub>keys</sub>(self, key<sub>data</sub>)</a>
<ul>
<li><a href="#sec-9-9-1">9.9.1 L749:</a></li>
</ul>
</li>
<li><a href="#sec-9-10">9.10 def recieve<sub>keys</sub>(self, keyserver, *keyids)</a>
<ul>
<li><a href="#sec-9-10-1">9.10.1 L770:</a></li>
</ul>
</li>
<li><a href="#sec-9-11">9.11 def export<sub>keys</sub>(self, keyids, secret=False)</a>
<ul>
<li><a href="#sec-9-11-1">9.11.1 L795-796:</a></li>
</ul>
</li>
<li><a href="#sec-9-12">9.12 def list<sub>keys</sub>(self, secret=False)</a>
<ul>
<li><a href="#sec-9-12-1">9.12.1 L827:</a></li>
</ul>
</li>
<li><a href="#sec-9-13">9.13 def gen<sub>key</sub>(self, input)</a>
<ul>
<li><a href="#sec-9-13-1">9.13.1 L864:</a></li>
</ul>
</li>
<li><a href="#sec-9-14">9.14 def gen<sub>key</sub><sub>input</sub>(self, **kwargs)</a>
<ul>
<li><a href="#sec-9-14-1">9.14.1 L981-983:</a></li>
</ul>
</li>
<li><a href="#sec-9-15">9.15 def encrypt<sub>file</sub>(self, file, recipiencts, sign=None, &hellip;)</a>
<ul>
<li><a href="#sec-9-15-1">9.15.1 L939:</a></li>
</ul>
</li>
<li><a href="#sec-9-16">9.16 def encrypt(self, data, recipients, **kwargs):</a>
<ul>
<li><a href="#sec-9-16-1">9.16.1 L997:</a></li>
</ul>
</li>
<li><a href="#sec-9-17">9.17 def decrypt(self, message **kwargs):</a>
<ul>
<li><a href="#sec-9-17-1">9.17.1 L1003:</a></li>
</ul>
</li>
<li><a href="#sec-9-18">9.18 def decrypt<sub>file</sub>(self, file, always<sub>trust</sub>=False, passphrase=None, output=None)</a>
<ul>
<li><a href="#sec-9-18-1">9.18.1 L1013:</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-10">10 POC</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> gnugp._<sub>main</sub>_<sub>()</sub></h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> comments</h3>
<div class="outline-text-3" id="text-1-1">

<p>L58 NullHandler?? see self.<sub>write</sub><sub>passphrase</sub>
L61 there nifty check for p3k
</p></div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> def <sub>copy</sub><sub>data</sub>(instream, outstream) &nbsp;&nbsp;&nbsp;<span class="tag"><span class="cleanup">cleanup</span></span></h3>
<div class="outline-text-3" id="text-1-2">

<p>   copies data from one stream to another, 1024 bytes at a time.
</p>
</div>

<div id="outline-container-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> L79: &nbsp;&nbsp;&nbsp;<span class="tag"><span class="bad_logic">bad_logic</span></span></h4>
<div class="outline-text-4" id="text-1-2-1">

<p>    instream is apparently a file descriptor, but is not checked nor
    encased in a try/except block.
</p>
</div>

</div>

<div id="outline-container-1-2-2" class="outline-4">
<h4 id="sec-1-2-2"><span class="section-number-4">1.2.2</span> L78: &nbsp;&nbsp;&nbsp;<span class="tag"><span class="hanging_fd">hanging_fd</span>&nbsp;<span class="bad_logic">bad_logic</span></span></h4>
<div class="outline-text-4" id="text-1-2-2">

<p>    while True: loop, should be 
</p><pre class="example">
with open(instream) as instrm:
</pre>

</div>

</div>

<div id="outline-container-1-2-3" class="outline-4">
<h4 id="sec-1-2-3"><span class="section-number-4">1.2.3</span> L88: &nbsp;&nbsp;&nbsp;<span class="tag"><span class="bad_exception_handling">bad_exception_handling</span></span></h4>
<div class="outline-text-4" id="text-1-2-3">

<pre class="example">
except: 
</pre>

<p>    should catch an IOError, or whatever specific error is raised for broken
    pipes.
</p></div>
</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> def <sub>threaded</sub><sub>copy</sub><sub>data</sub>(instream, outstream):</h3>
<div class="outline-text-3" id="text-1-3">


</div>

<div id="outline-container-1-3-1" class="outline-4">
<h4 id="sec-1-3-1"><span class="section-number-4">1.3.1</span> L99:</h4>
<div class="outline-text-4" id="text-1-3-1">

<p>    this just wraps self.<sub>copy</sub><sub>data</sub> in a thread
</p></div>
</div>

</div>

<div id="outline-container-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> def <sub>write</sub><sub>passphrase</sub>(stream, passphrase, encoding): &nbsp;&nbsp;&nbsp;<span class="tag"><span class="vuln">vuln</span>&nbsp;<span class="cleanup">cleanup</span></span></h3>
<div class="outline-text-3" id="text-1-4">


</div>

<div id="outline-container-1-4-1" class="outline-4">
<h4 id="sec-1-4-1"><span class="section-number-4">1.4.1</span> L110: &nbsp;&nbsp;&nbsp;<span class="tag"><span class="writes_passphrase_to_disk">writes_passphrase_to_disk</span></span></h4>
<div class="outline-text-4" id="text-1-4-1">

<p>    logger writes passphrase into debug log. this should be patched.
</p></div>
</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> class Verify(object)</h2>
<div class="outline-text-2" id="text-2">

<p>  basic parsing class, no errors found
</p></div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> class ImportResult(object)</h2>
<div class="outline-text-2" id="text-3">

<p>  basic parsing class, no errors found
</p></div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> class ListKeys(list):</h2>
<div class="outline-text-2" id="text-4">

<p>  basic parsing class, no errors found
</p></div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> class Crypt(Verify):</h2>
<div class="outline-text-2" id="text-5">

<p>  basic parsing class, no errors found
</p>
</div>

<div id="outline-container-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> def _<sub>init</sub>_<sub>(self, gpg)</sub> &nbsp;&nbsp;&nbsp;<span class="tag"><span class="cleanup">cleanup</span></span></h3>
<div class="outline-text-3" id="text-5-1">


</div>

<div id="outline-container-5-1-1" class="outline-4">
<h4 id="sec-5-1-1"><span class="section-number-4">5.1.1</span> L338 &nbsp;&nbsp;&nbsp;<span class="tag"><span class="mro_conflict">mro_conflict</span></span></h4>
<div class="outline-text-4" id="text-5-1-1">





<pre class="src src-python">Verify.__init__(<span style="color: #00cdcd; font-weight: bold;">self</span>,gpg)
</pre>


<p>
    should be changed to:
</p>



<pre class="src src-python"><span style="color: #0000ee; font-weight: bold;">super</span>(Verify, <span style="color: #00cdcd; font-weight: bold;">self</span>).__init__(gpg)
</pre>

</div>
</div>
</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> class GenKey(object)</h2>
<div class="outline-text-2" id="text-6">

<p>  basic parsing class, no errors found
</p></div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> class DeleteResult(object)</h2>
<div class="outline-text-2" id="text-7">

<p>  basic parsing class, no errors found
</p></div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> class Sign(object)</h2>
<div class="outline-text-2" id="text-8">

<p>  basic parsing class, no errors found
</p></div>

</div>

<div id="outline-container-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> class GPG(object) &nbsp;&nbsp;&nbsp;<span class="tag"><span class="exploitable">exploitable</span></span></h2>
<div class="outline-text-2" id="text-9">


</div>

<div id="outline-container-9-1" class="outline-4">
<h4 id="sec-9-1"><span class="section-number-4">9.1</span> L474: &nbsp;&nbsp;&nbsp;<span class="tag"><span class="cleanup">cleanup</span></span></h4>
<div class="outline-text-4" id="text-9-1">

<pre class="example">
cls.__doc__ 
</pre>

<p>    should go directly underneath class signature
</p></div>

</div>

<div id="outline-container-9-1" class="outline-3">
<h3 id="sec-9-1"><span class="section-number-3">9.1</span> def _<sub>init</sub>_<sub>(self, gpgbinary='gpg', gnupghome=None, verbose=False, use<sub>agent</sub>=False, keyring=None)</sub> &nbsp;&nbsp;&nbsp;<span class="tag"><span class="bug">bug</span></span></h3>
<div class="outline-text-3" id="text-9-1">


</div>
