docs/NOTES-python-gnupg-3.1-audit.org
*** L494-495:                                                    :type_error:
    
    #+BEGIN_SRC python
    if gnupghome and not os.path.isdir(self.gnupghome):
        os.makedirs(self.gnupghome,0x1C0)
    #+END_SRC

    #+BEGIN_EXAMPLE
    In [20]: os.makedirs?
    Type:       function
    String Form:<function makedirs at 0x7f8ddeb6cc08>
    File:       /usr/lib/python2.7/os.py
    Definition: os.makedirs(name, mode=511)
    Docstring:
    makedirs(path [, mode=0777])
    Super-mkdir; create a leaf directory and all intermediate ones.
    Works like mkdir, except that any intermediate path segment (not
    just the rightmost) will be created if it does not exist.  This is
    recursive.
    
    setting mode=0x1c0 is equivalent to mode=hex(0700), which
    may cause bugs on some systems, see
    http://ubuntuforums.org/showthread.php?t=2044879
    
    this could be do to the complete lack of input validation in
    os.makedirs, and it's calling of the os.mkdir() built-in, which
    may vary depending on the python compilation:
    #+END_EXAMPLE

    #+BEGIN_SRC python
    Source:
    def makedirs(name, mode=0777):
        """makedirs(path [, mode=0777])
        
        Super-mkdir; create a leaf directory and all intermediate ones.
        Works like mkdir, except that any intermediate path segment (not
        just the rightmost) will be created if it does not exist.  This is
        recursive.
        """
        head, tail = path.split(name)
        if not tail:
            head, tail = path.split(head)
        if head and tail and not path.exists(head):
            try:
                makedirs(head, mode)
            except OSError, e:
                # be happy if someone already created the path
                if e.errno != errno.EEXIST:
                    raise
            if tail == curdir:           # xxx/newdir/. exists if xxx/newdir exists
                return
        mkdir(name, mode)
    #+END_SRC

** def _open_subprocess(self, args, passphrase=False)                  :vuln:
*** L515:                                            :unvalidated_user_input:
    : cmd.extend(args)
    
    cmd is a list of strings, eventually joined with cmd=' '.join(cmd), and
    the args are unvalidated in this function. Then this concatenation of args
    is fed directly into subprocess.Popen(cmd, shell=True, stdin=PIPE,
    stdout=PIPE, stderr=PIPE). THIS SHOULD BE PATCHED.

** def _collect_output(self, process, result, writer=None, stdin=None)
   sends stdout to self._read_data() and stderr to self._read_response()

** def _handle_io(self, args, file, result, passphrase=None, binary=False) :vuln:cleanup:
*** L601:                         :unvalidated_user_input:type_check_in_call:
    : p = self._open_subprocess(args, passphrase is not None)
    
    you shouldn't assign or type check in a function call

** def sign(self, message, **kwargs)                                :cleanup:
*** L617-619:                                                    :hanging_fd:
   calls self._make_binary_stream(), which leaves the file descriptor for
   the encoded message to be encrypted hanging between scopes.

** def sign_file(self, file, keyid=None, passphrase=None, clearsign=True, detach=False, binary=False) :cleanup:
*** L632-635:                                                     :bad_logic:
    #+BEGIN_SRC python
    if detach:
        args.append("--detach-sign")
    elif clearsign:
        args.append("--clearsign")
    #+END_SRC

    the logic here allows that if a user erroneously specifies both options,
    rather than doing what the system gnupg would do (that is, do --clearsign,
    and ignore the --attach-sign), python-gnupg would ignore both.

*** L626-641:
    input 'args' into self._open_subprocess() is defined as static strings.
    
** def verify(self, data):                                          :cleanup:
*** L668-670:                                                    :hanging_fd:
    same hanging file descriptor problem as in self.sign()

** def verify_file(self, file, data_filename=None)             :vuln:cleanup:
*** L683:                                                        :hanging_fd:
    more potentially hanging file descriptors...
*** L684:                                                        :hanging_fd:
    oh look, another hanging file descriptor. imagine that.
*** L690:                                            :unvalidated_user_input:
    : args.append('"%s"' % data_filename)
    well, there's the exploit. see included POC script.

** def import_keys(self, key_data)                                     :vuln:
