NOTES-python-gnupg-3.1-audit.html

<div id="outline-container-9-1-1" class="outline-4">
<h4 id="sec-9-1-1"><span class="section-number-4">9.1.1</span> L494-495: &nbsp;&nbsp;&nbsp;<span class="tag"><span class="type_error">type_error</span></span></h4>
<div class="outline-text-4" id="text-9-1-1">





<pre class="src src-python"><span style="color: #00cdcd; font-weight: bold;">if</span> gnupghome <span style="color: #00cdcd; font-weight: bold;">and</span> <span style="color: #00cdcd; font-weight: bold;">not</span> os.path.isdir(<span style="color: #00cdcd; font-weight: bold;">self</span>.gnupghome):
    os.makedirs(<span style="color: #00cdcd; font-weight: bold;">self</span>.gnupghome,0x1C0)
</pre>



<pre class="example">In [20]: os.makedirs?
Type:       function
String Form:&lt;function makedirs at 0x7f8ddeb6cc08&gt;
File:       /usr/lib/python2.7/os.py
Definition: os.makedirs(name, mode=511)
Docstring:
makedirs(path [, mode=0777])
Super-mkdir; create a leaf directory and all intermediate ones.
Works like mkdir, except that any intermediate path segment (not
just the rightmost) will be created if it does not exist.  This is
recursive.

setting mode=0x1c0 is equivalent to mode=hex(0700), which
may cause bugs on some systems, see
http://ubuntuforums.org/showthread.php?t=2044879

this could be do to the complete lack of input validation in
os.makedirs, and it's calling of the os.mkdir() built-in, which
may vary depending on the python compilation:
</pre>



<pre class="src src-python">Source:
<span style="color: #00cdcd; font-weight: bold;">def</span> <span style="color: #0000ee; font-weight: bold;">makedirs</span>(name, mode=0777):
    <span style="color: #00cd00;">"""makedirs(path [, mode=0777])</span>

<span style="color: #00cd00;">    Super-mkdir; create a leaf directory and all intermediate ones.</span>
<span style="color: #00cd00;">    Works like mkdir, except that any intermediate path segment (not</span>
<span style="color: #00cd00;">    just the rightmost) will be created if it does not exist.  This is</span>
<span style="color: #00cd00;">    recursive.</span>
<span style="color: #00cd00;">    """</span>
    <span style="color: #cdcd00;">head</span>, <span style="color: #cdcd00;">tail</span> = path.split(name)
    <span style="color: #00cdcd; font-weight: bold;">if</span> <span style="color: #00cdcd; font-weight: bold;">not</span> tail:
        <span style="color: #cdcd00;">head</span>, <span style="color: #cdcd00;">tail</span> = path.split(head)
    <span style="color: #00cdcd; font-weight: bold;">if</span> head <span style="color: #00cdcd; font-weight: bold;">and</span> tail <span style="color: #00cdcd; font-weight: bold;">and</span> <span style="color: #00cdcd; font-weight: bold;">not</span> path.exists(head):
        <span style="color: #00cdcd; font-weight: bold;">try</span>:
            makedirs(head, mode)
        <span style="color: #00cdcd; font-weight: bold;">except</span> <span style="color: #00cd00;">OSError</span>, e:
            <span style="color: #cdcd00;"># </span><span style="color: #cdcd00;">be happy if someone already created the path</span>
            <span style="color: #00cdcd; font-weight: bold;">if</span> e.errno != errno.EEXIST:
                <span style="color: #00cdcd; font-weight: bold;">raise</span>
        <span style="color: #00cdcd; font-weight: bold;">if</span> tail == curdir:           <span style="color: #cdcd00;"># </span><span style="color: #cdcd00;">xxx/newdir/. exists if xxx/newdir exists</span>
            <span style="color: #00cdcd; font-weight: bold;">return</span>
    mkdir(name, mode)
</pre>


</div>
</div>

</div>

<div id="outline-container-9-2" class="outline-3">
<h3 id="sec-9-2"><span class="section-number-3">9.2</span> def <sub>open</sub><sub>subprocess</sub>(self, args, passphrase=False) &nbsp;&nbsp;&nbsp;<span class="tag"><span class="vuln">vuln</span></span></h3>
<div class="outline-text-3" id="text-9-2">


</div>

<div id="outline-container-9-2-1" class="outline-4">
<h4 id="sec-9-2-1"><span class="section-number-4">9.2.1</span> L515: &nbsp;&nbsp;&nbsp;<span class="tag"><span class="unvalidated_user_input">unvalidated_user_input</span></span></h4>
<div class="outline-text-4" id="text-9-2-1">

<pre class="example">
cmd.extend(args)
</pre>


<p>    
    cmd is a list of strings, eventually joined with cmd=' '.join(cmd), and
    the args are unvalidated in this function. Then this concatenation of args
    is fed directly into subprocess.Popen(cmd, shell=True, stdin=PIPE,
    stdout=PIPE, stderr=PIPE). THIS SHOULD BE PATCHED.
</p>
</div>
</div>

</div>

<div id="outline-container-9-3" class="outline-3">
<h3 id="sec-9-3"><span class="section-number-3">9.3</span> def <sub>collect</sub><sub>output</sub>(self, process, result, writer=None, stdin=None)</h3>
<div class="outline-text-3" id="text-9-3">

<p>   sends stdout to self.<sub>read</sub><sub>data</sub>() and stderr to self.<sub>read</sub><sub>response</sub>()
</p>
</div>

</div>

<div id="outline-container-9-4" class="outline-3">
<h3 id="sec-9-4"><span class="section-number-3">9.4</span> def <sub>handle</sub><sub>io</sub>(self, args, file, result, passphrase=None, binary=False) &nbsp;&nbsp;&nbsp;<span class="tag"><span class="vuln">vuln</span>&nbsp;<span class="cleanup">cleanup</span></span></h3>
<div class="outline-text-3" id="text-9-4">


</div>

<div id="outline-container-9-4-1" class="outline-4">
<h4 id="sec-9-4-1"><span class="section-number-4">9.4.1</span> L601: &nbsp;&nbsp;&nbsp;<span class="tag"><span class="unvalidated_user_input">unvalidated_user_input</span>&nbsp;<span class="type_check_in_call">type_check_in_call</span></span></h4>
<div class="outline-text-4" id="text-9-4-1">

<pre class="example">
p = self._open_subprocess(args, passphrase is not None)
</pre>


<p>    
    you shouldn't assign or type check in a function call
</p>
</div>
</div>

</div>

<div id="outline-container-9-5" class="outline-3">
<h3 id="sec-9-5"><span class="section-number-3">9.5</span> def sign(self, message, **kwargs) &nbsp;&nbsp;&nbsp;<span class="tag"><span class="cleanup">cleanup</span></span></h3>
<div class="outline-text-3" id="text-9-5">


</div>

<div id="outline-container-9-5-1" class="outline-4">
<h4 id="sec-9-5-1"><span class="section-number-4">9.5.1</span> L617-619: &nbsp;&nbsp;&nbsp;<span class="tag"><span class="hanging_fd">hanging_fd</span></span></h4>
<div class="outline-text-4" id="text-9-5-1">

<p>   calls self.<sub>make</sub><sub>binary</sub><sub>stream</sub>(), which leaves the file descriptor for
   the encoded message to be encrypted hanging between scopes.
</p>
</div>
</div>

</div>

<div id="outline-container-9-6" class="outline-3">
<h3 id="sec-9-6"><span class="section-number-3">9.6</span> def sign<sub>file</sub>(self, file, keyid=None, passphrase=None, clearsign=True, detach=False, binary=False) &nbsp;&nbsp;&nbsp;<span class="tag"><span class="cleanup">cleanup</span></span></h3>
<div class="outline-text-3" id="text-9-6">


</div>

<div id="outline-container-9-6-1" class="outline-4">
<h4 id="sec-9-6-1"><span class="section-number-4">9.6.1</span> L632-635: &nbsp;&nbsp;&nbsp;<span class="tag"><span class="bad_logic">bad_logic</span></span></h4>
<div class="outline-text-4" id="text-9-6-1">




<pre class="src src-python"><span style="color: #00cdcd; font-weight: bold;">if</span> detach:
    args.append(<span style="color: #00cd00;">"--detach-sign"</span>)
<span style="color: #00cdcd; font-weight: bold;">elif</span> clearsign:
    args.append(<span style="color: #00cd00;">"--clearsign"</span>)
</pre>


<p>
    the logic here allows that if a user erroneously specifies both options,
    rather than doing what the system gnupg would do (that is, do &ndash;clearsign,
    and ignore the &ndash;attach-sign), python-gnupg would ignore both.
</p>
</div>

</div>

<div id="outline-container-9-6-2" class="outline-4">
<h4 id="sec-9-6-2"><span class="section-number-4">9.6.2</span> L626-641:</h4>
<div class="outline-text-4" id="text-9-6-2">

<p>    input 'args' into self.<sub>open</sub><sub>subprocess</sub>() is defined as static strings.
</p>
</div>
</div>

</div>

<div id="outline-container-9-7" class="outline-3">
<h3 id="sec-9-7"><span class="section-number-3">9.7</span> def verify(self, data): &nbsp;&nbsp;&nbsp;<span class="tag"><span class="cleanup">cleanup</span></span></h3>
<div class="outline-text-3" id="text-9-7">


</div>

<div id="outline-container-9-7-1" class="outline-4">
<h4 id="sec-9-7-1"><span class="section-number-4">9.7.1</span> L668-670: &nbsp;&nbsp;&nbsp;<span class="tag"><span class="hanging_fd">hanging_fd</span></span></h4>
<div class="outline-text-4" id="text-9-7-1">

<p>    same hanging file descriptor problem as in self.sign()
</p>
</div>
</div>

</div>

<div id="outline-container-9-8" class="outline-3">
<h3 id="sec-9-8"><span class="section-number-3">9.8</span> def verify<sub>file</sub>(self, file, data<sub>filename</sub>=None) &nbsp;&nbsp;&nbsp;<span class="tag"><span class="vuln">vuln</span>&nbsp;<span class="cleanup">cleanup</span></span></h3>
<div class="outline-text-3" id="text-9-8">


</div>

<div id="outline-container-9-8-1" class="outline-4">
<h4 id="sec-9-8-1"><span class="section-number-4">9.8.1</span> L683: &nbsp;&nbsp;&nbsp;<span class="tag"><span class="hanging_fd">hanging_fd</span></span></h4>
<div class="outline-text-4" id="text-9-8-1">

<p>    more potentially hanging file descriptors&hellip;
</p></div>

</div>

<div id="outline-container-9-8-2" class="outline-4">
<h4 id="sec-9-8-2"><span class="section-number-4">9.8.2</span> L684: &nbsp;&nbsp;&nbsp;<span class="tag"><span class="hanging_fd">hanging_fd</span></span></h4>
<div class="outline-text-4" id="text-9-8-2">

<p>    oh look, another hanging file descriptor. imagine that.
</p></div>

</div>

<div id="outline-container-9-8-3" class="outline-4">
<h4 id="sec-9-8-3"><span class="section-number-4">9.8.3</span> L690: &nbsp;&nbsp;&nbsp;<span class="tag"><span class="unvalidated_user_input">unvalidated_user_input</span></span></h4>
<div class="outline-text-4" id="text-9-8-3">

<pre class="example">
args.append('"%s"' % data_filename)
</pre>

<p>    well, there's the exploit. see included POC script.
</p>
</div>
</div>

</div>

<div id="outline-container-9-9" class="outline-3">
<h3 id="sec-9-9"><span class="section-number-3">9.9</span> def import<sub>keys</sub>(self, key<sub>data</sub>) &nbsp;&nbsp;&nbsp;<span class="tag"><span class="vuln">vuln</span></span></h3>
<div class="outline-text-3" id="text-9-9">


</div>
