docs/NOTES-python-gnupg-3.1-audit.org
*** L749:                                            :unvalidated_user_input:
    this function could potentially allow an attacker with a GPG exploit to
    use it, because it passes key generation parameter directly into the
    internal packet parsers of GPG. however, without a GPG exploit for one of
    the GPG packet parsers (for explanation of GPG packets look into pgpdump),
    this function alone is not exploitable.    

** def recieve_keys(self, keyserver, *keyids)                          :vuln:
*** L770:                                            :unvalidated_user_input:
    : args.extend(keyids)

** def export_keys(self, keyids, secret=False)                         :vuln:
*** L795-796:                                        :unvalidated_user_input:
    args problem again. exploitable though parameter ``keyids``.

** def list_keys(self, secret=False)
*** L827:
    args is static string.

** def gen_key(self, input)                                         :cleanup:
*** L864:
    args, passed to self._handle_io(), which in turn passes args directly to
    Popen(), is set to a static string. this function is halfway okay, though
    it really could be more careful with the ``input`` parameter.

** def gen_key_input(self, **kwargs)                                   :vuln:
*** L981-983:                                        :unvalidated_user_input:
    this function could potentially allow an attacker with a GPG exploit to
    use it, because it passes key generation parameter directly into the
    internal packet parsers of GPG. however, without a GPG exploit for one of
    the GPG packet parsers (for explanation of GPG packets look into pgpdump),
    this function alone is not exploitable.

** def encrypt_file(self, file, recipiencts, sign=None, ...)           :vuln:
*** L939:                                            :unvalidated_user_input:
    several of the inputs to this function are unvalidated, turned into
    strings, and passed to Popen(). exploitable.

** def encrypt(self, data, recipients, **kwargs):                      :vuln:
*** L997:                                            :unvalidated_user_input:
    exploitable, passes kwargs to self.encrypt_file()

** def decrypt(self, message **kwargs):                                :vuln:
*** L1003:                                           :unvalidated_user_input:
    kwargs are passed to self.decrypt_file(), unvalidated, making this
    function also exploitable

** def decrypt_file(self, file, always_trust=False, passphrase=None, output=None) :vuln:
*** L1013:                                           :unvalidated_user_input:
    unvalidated user input: this function is also exploitable

* POC
#+INCLUDE: "../python-gnupg-0.3.1/python-gnupg-exploit.py" python
