NOTES-python-gnupg-3.1-audit.html

<div id="outline-container-9-9-1" class="outline-4">
<h4 id="sec-9-9-1"><span class="section-number-4">9.9.1</span> L749: &nbsp;&nbsp;&nbsp;<span class="tag"><span class="unvalidated_user_input">unvalidated_user_input</span></span></h4>
<div class="outline-text-4" id="text-9-9-1">

<p>    this function could potentially allow an attacker with a GPG exploit to
    use it, because it passes key generation parameter directly into the
    internal packet parsers of GPG. however, without a GPG exploit for one of
    the GPG packet parsers (for explanation of GPG packets look into pgpdump),
    this function alone is not exploitable.    
</p>
</div>
</div>

</div>

<div id="outline-container-9-10" class="outline-3">
<h3 id="sec-9-10"><span class="section-number-3">9.10</span> def recieve<sub>keys</sub>(self, keyserver, *keyids) &nbsp;&nbsp;&nbsp;<span class="tag"><span class="vuln">vuln</span></span></h3>
<div class="outline-text-3" id="text-9-10">


</div>

<div id="outline-container-9-10-1" class="outline-4">
<h4 id="sec-9-10-1"><span class="section-number-4">9.10.1</span> L770: &nbsp;&nbsp;&nbsp;<span class="tag"><span class="unvalidated_user_input">unvalidated_user_input</span></span></h4>
<div class="outline-text-4" id="text-9-10-1">

<pre class="example">
args.extend(keyids)
</pre>


</div>
</div>

</div>

<div id="outline-container-9-11" class="outline-3">
<h3 id="sec-9-11"><span class="section-number-3">9.11</span> def export<sub>keys</sub>(self, keyids, secret=False) &nbsp;&nbsp;&nbsp;<span class="tag"><span class="vuln">vuln</span></span></h3>
<div class="outline-text-3" id="text-9-11">


</div>

<div id="outline-container-9-11-1" class="outline-4">
<h4 id="sec-9-11-1"><span class="section-number-4">9.11.1</span> L795-796: &nbsp;&nbsp;&nbsp;<span class="tag"><span class="unvalidated_user_input">unvalidated_user_input</span></span></h4>
<div class="outline-text-4" id="text-9-11-1">

<p>    args problem again. exploitable though parameter ``keyids``.
</p>
</div>
</div>

</div>

<div id="outline-container-9-12" class="outline-3">
<h3 id="sec-9-12"><span class="section-number-3">9.12</span> def list<sub>keys</sub>(self, secret=False)</h3>
<div class="outline-text-3" id="text-9-12">


</div>

<div id="outline-container-9-12-1" class="outline-4">
<h4 id="sec-9-12-1"><span class="section-number-4">9.12.1</span> L827:</h4>
<div class="outline-text-4" id="text-9-12-1">

<p>    args is static string.
</p>
</div>
</div>

</div>

<div id="outline-container-9-13" class="outline-3">
<h3 id="sec-9-13"><span class="section-number-3">9.13</span> def gen<sub>key</sub>(self, input) &nbsp;&nbsp;&nbsp;<span class="tag"><span class="cleanup">cleanup</span></span></h3>
<div class="outline-text-3" id="text-9-13">


</div>

<div id="outline-container-9-13-1" class="outline-4">
<h4 id="sec-9-13-1"><span class="section-number-4">9.13.1</span> L864:</h4>
<div class="outline-text-4" id="text-9-13-1">

<p>    args, passed to self.<sub>handle</sub><sub>io</sub>(), which in turn passes args directly to
    Popen(), is set to a static string. this function is halfway okay, though
    it really could be more careful with the ``input`` parameter.
</p>
</div>
</div>

</div>

<div id="outline-container-9-14" class="outline-3">
<h3 id="sec-9-14"><span class="section-number-3">9.14</span> def gen<sub>key</sub><sub>input</sub>(self, **kwargs) &nbsp;&nbsp;&nbsp;<span class="tag"><span class="vuln">vuln</span></span></h3>
<div class="outline-text-3" id="text-9-14">


</div>

<div id="outline-container-9-14-1" class="outline-4">
<h4 id="sec-9-14-1"><span class="section-number-4">9.14.1</span> L981-983: &nbsp;&nbsp;&nbsp;<span class="tag"><span class="unvalidated_user_input">unvalidated_user_input</span></span></h4>
<div class="outline-text-4" id="text-9-14-1">

<p>    this function could potentially allow an attacker with a GPG exploit to
    use it, because it passes key generation parameter directly into the
    internal packet parsers of GPG. however, without a GPG exploit for one of
    the GPG packet parsers (for explanation of GPG packets look into pgpdump),
    this function alone is not exploitable.
</p>
</div>
</div>

</div>

<div id="outline-container-9-15" class="outline-3">
<h3 id="sec-9-15"><span class="section-number-3">9.15</span> def encrypt<sub>file</sub>(self, file, recipiencts, sign=None, &hellip;) &nbsp;&nbsp;&nbsp;<span class="tag"><span class="vuln">vuln</span></span></h3>
<div class="outline-text-3" id="text-9-15">


</div>

<div id="outline-container-9-15-1" class="outline-4">
<h4 id="sec-9-15-1"><span class="section-number-4">9.15.1</span> L939: &nbsp;&nbsp;&nbsp;<span class="tag"><span class="unvalidated_user_input">unvalidated_user_input</span></span></h4>
<div class="outline-text-4" id="text-9-15-1">

<p>    several of the inputs to this function are unvalidated, turned into
    strings, and passed to Popen(). exploitable.
</p>
</div>
</div>

</div>

<div id="outline-container-9-16" class="outline-3">
<h3 id="sec-9-16"><span class="section-number-3">9.16</span> def encrypt(self, data, recipients, **kwargs): &nbsp;&nbsp;&nbsp;<span class="tag"><span class="vuln">vuln</span></span></h3>
<div class="outline-text-3" id="text-9-16">


</div>

<div id="outline-container-9-16-1" class="outline-4">
<h4 id="sec-9-16-1"><span class="section-number-4">9.16.1</span> L997: &nbsp;&nbsp;&nbsp;<span class="tag"><span class="unvalidated_user_input">unvalidated_user_input</span></span></h4>
<div class="outline-text-4" id="text-9-16-1">

<p>    exploitable, passes kwargs to self.encrypt<sub>file</sub>()
</p>
</div>
</div>

</div>

<div id="outline-container-9-17" class="outline-3">
<h3 id="sec-9-17"><span class="section-number-3">9.17</span> def decrypt(self, message **kwargs): &nbsp;&nbsp;&nbsp;<span class="tag"><span class="vuln">vuln</span></span></h3>
<div class="outline-text-3" id="text-9-17">


</div>

<div id="outline-container-9-17-1" class="outline-4">
<h4 id="sec-9-17-1"><span class="section-number-4">9.17.1</span> L1003: &nbsp;&nbsp;&nbsp;<span class="tag"><span class="unvalidated_user_input">unvalidated_user_input</span></span></h4>
<div class="outline-text-4" id="text-9-17-1">

<p>    kwargs are passed to self.decrypt<sub>file</sub>(), unvalidated, making this
    function also exploitable
</p>
</div>
</div>

</div>

<div id="outline-container-9-18" class="outline-3">
<h3 id="sec-9-18"><span class="section-number-3">9.18</span> def decrypt<sub>file</sub>(self, file, always<sub>trust</sub>=False, passphrase=None, output=None) &nbsp;&nbsp;&nbsp;<span class="tag"><span class="vuln">vuln</span></span></h3>
<div class="outline-text-3" id="text-9-18">


</div>

<div id="outline-container-9-18-1" class="outline-4">
<h4 id="sec-9-18-1"><span class="section-number-4">9.18.1</span> L1013: &nbsp;&nbsp;&nbsp;<span class="tag"><span class="unvalidated_user_input">unvalidated_user_input</span></span></h4>
<div class="outline-text-4" id="text-9-18-1">

<p>    unvalidated user input: this function is also exploitable
</p>
</div>
</div>
</div>

</div>

<div id="outline-container-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> POC</h2>
<div class="outline-text-2" id="text-10">

<p>CANNOT INCLUDE FILE ../python-gnupg-0.3.1/python-gnupg-exploit.py
</p></div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2013-02-01 Fri</p>
<p class="author">Author: isis</p>
<p class="email"><a href="mailto:isis@leap.se">isis@leap.se</a></p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.2 with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
